
                                    #################
                   ###################-------------######################  
    #################-----------         Задание            -----------#######################
 ################################################################################################
###                                                                                            ###
##                                                                                              ##
#                                                                                                #
#                                                                                                #
#       У нас есть герой и драконы, чтобы победить одного дракона нашему герою нужно 2 пули.     #
#                                                                                                #
#       Пользователь вводит кол-во пуль для нашего героя и кол-во драконов напавших на него.     #
#       Нужно вывести результат,                                                                 #
#       сможет ли герой победить всех драконов или нет.                                          #
#                                                                                                #
#                                                                                                #
##                                                                                              ## 
###                                                                                            ###
 ################################################################################################
    ##################################---------------------###################################
                                    #########################

############################################
# number_of_bullets = int(input())
# dragons = int(input())
# #20 we have bullets
# #6 dragons!

# need_bullets = dragons * 2

# if number_of_bullets >= need_bullets:
#     print("Congrtulations, you won!")
# else:
#     print("Sorry, you lost!(")    

###############################################


# age = 17


# if age >= 18:
#     print("Is adult")
# else:
#     print("Is young")

#################################################
# -Задание 1-

# Пользователь вводит свой возраст, программа должна определить и вывести, пенсионер 
# он или нет. (Пенсионный возраст: 55)


# -Задание 2-

# У нас в продаже шкаф шириной в 150 см, и высотой в 200 см. 

# Реализовать приложение в котором пользователь может ввести ширину и высоту своего
# свободного места, а наша программа должна проверить, вмещается ли туда наш шкаф.


# -Задание 3-

# Пользователь вводит сколько он потратил кубометров воды за месяц.

# Норма кубометров воды в месяц - 50

# Вывести пользователю, превысил ли он месячную норму.
############################################################

# client = int(input())
# if client >= 55:
#     print("You are a pensioner!")
# else:
#     print("Unfortunately you have not reached retirement age!")     
########################################################################
# width = 150
# height = 200
# own_width = int(input())
# own_height = int(input())

# if own_width >= width and own_height >= height:
#     print("You succeeded,buy a wardrobe")
# else:
#     print("Unfortunately your sizes don't fit!")
###########################################################################

# water_norm_per_month = 50
# water_waster_per_month = int(input())

# if water_norm_per_month <= water_waster_per_month:
#     print("Congratulations,you have not exceeded the limit!")
# else:
#     print("Unfortunately you have exceeded the limit!")

#############################################################################

# Пользователь вводит номер сезона: 1 - Зима, 2 - Весна, 3 - Лето, 4 - Осень.

# В зависимости от введенного номера, вывести сезон.
# Если такого номера нет, вывести сообщение о некорректном вводе.

# season = int(input())
# if season == 1:
#     print("Winter")
# if season == 2:
#     print("Spring")
# if season == 3:
#     print("Summer")
# if season == 4:
#     print("Outumn")   
# if season >= 5 or season <= 0:
#     print("You entered the number incorrectly,try again.")             