model_phone = "iPhone 14 Pro"
megapixels = 48
resolution = "ProRAW"

#############################
# print(type(megapixels))
# print(type(model_phone))
# print(type(resolution))
###################################
# temp = str(megapixels)

# print(type(temp))
# print(temp)
#################################

# megapixels = str(megapixels)
####################################
# print( model_phone  + " поднимает планку возможностей " + str(megapixels) + " мегапикселей, обеспечивая в 4 раза большее разрешение в " + resolution + " для умопомрачительной детализации в каждом кадре ." )


# print(megapixels + 10)


################################


# name = "Diana"
# age = 30


# print("Hi I'm " + name + " I'm " + str(age) + " years old")
# print(str(age))



# У нас есть переменные:

python_creator_name = "Гвидо ван Россум родился"

birthday_day = 31
birthday_month = 1
birthday_year = 1956

info = "голландский программист, прежде всего известный как автор языка программирования Python."

# Задача состоит в том, чтобы вывести вот такой текст:
# "Гвидо ван Россум родился 13/1/1956, голландский программист, прежде всего известный как автор языка программирования Python"

birthday_day_str = str(birthday_day)

print(python_creator_name + " " + birthday_day_str + "/"+ str(birthday_month)+ "/" +str(birthday_year)+ " " +info)

# print(5+3)

# print(8)

############# homework 09.17.23
### number 1
city = "Kyiv"
people = 600000

print("Добро пожаловать в наш город" + " " + city + " у нас живут "  + " " + str(people))

########### number 2
month = 12
salary = 20000


full_sal = month * salary

print( " Вы заработали " + str(full_sal) + " за количество " + str(month) + " месяца " )
print( " Вы заработали " + str(month * salary) + " за количество " + str(month) + " месяца " )

#######################################


film = "translator"
year = 2023
rating = 8

# Задача в том, чтобы вывести вот такой текст:
# "Мне очень нравится фильм 'название', он вышел в 'год выпуска' с оценкой в 'оценка'."

print("Мне очень нравится фильм " + film + " он вышел в " + str(year) + " с оценкой в " + str(rating))

########################################################


# coffee_shop = "starbucks"
# number_sold = 100
# cost_of_one_mug = 7

# print(" Моя кофейня " + coffee_shop + " заработала за сегодня " + str(number_sold * cost_of_one_mug))





# print("Прошло дней: " + str(4 * 31))
# print("4*31")

#####################################

#
#   **
#  ****
#  ****
#   **
#


a = "   *****"
b = " ***   ***"
c = " ***   ***"
d = "   *****"

print(a)
print(b)
print(c)
print(d)


print(" ***   ***")
print(" ***   ***")
print("   *****")

#👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻

###############################

# plantation = "strawberry"
# workers = 50
# kg = 1

# print("добро пожаловать к нам на плантацию" + plantation + " на ней работают " + str(workers)+ " и за день собирают " + str( workers * kg ) + " kg "  )



